<template>
  <transition-group tag="div" appear @before-enter="beforeEnter" @enter="enter">
    <div key="div" class="font-rubik bg-gray-50">
      <header>
        <nav class="sticky top-0 z-10 bg-gray-100">
          <div class="px-4">
            <div class="flex items-center justify-between h-16">
              <div
                class="flex items-center space-s-6 text-gray-900 font-medium"
              >
                <a
                  class="transition duration-500 ease-in-out hover:text-gray-500 "
                  href="#contact"
                  >Contacts</a
                >
                <a
                  class="transition duration-500 ease-in-out hover:text-gray-500 "
                  href="#about"
                  >About</a
                >
                <a
                  class="border-2 transition duration-500 ease-in-out hover:bg-gray-800 hover:text-gray-50 border-gray-700 py-2 px-4"
                  href="#"
                  >Home</a
                >
              </div>
              <span class="text-2xl text-gray-900 font-bold">ND</span>
            </div>
          </div>
        </nav>
        <section class="relative flex">
          <img
            class="w-full object-cover sm:h-72 md:h-96 lg:w-full lg:h-full"
            src="https://res.cloudinary.com/dxeebmzdv/image/upload/q_auto:good/v1631721290/nitay_upvtvm.webp"
            alt="Nitay Dor"
            width="1511"
            height="800"
          />
          <div
            class="absolute xl:left-1/4 lg:left-40 sm:left-14 left-10 inset-y-1/3 text-right"
          >
            <h1 class="md:text-8xl sm:text-5xl text-4xl ">ניתאי דור</h1>
            <p class="text-2xl">יועץ נדל''ן</p>
          </div>
        </section>
      </header>
      <main id="about" class="max-w-7xl mx-auto px-4">
        <article class="text-right my-8">
          <h2 class="md:text-5xl text-4xl mr-5">קצת על עצמי</h2>
          <div class="flex lg:flex-row flex-col-reverse mt-4 mb-20">
            <div
              class="relative w-full lg:w-3/4 p-14 text-left text-4xl lg:text-5xl bg-gray-100"
            >
              <q dir="ltr">
                The house of the future won't just be better than the house you
                have today.</q
              >
            </div>
            <p class="text-xl w-full p-5 text-justify rtl">
              <span class="text-2xl">
                היי חברים! שמי <strong>נתאי דור</strong> ואני יועץ הנדל"ן ב-
                <strong>RE/MAX</strong></span
              >
              <br />

              <span class="block leading-relaxed mt-3">
                אני מזמין אותכם להשתמש בשירותי הסוכנות שלי. אני מתווך נדל"ן, אני
                מחזיק את האצבע על הדופק של שוק הנדל"ן ויודע הכל על הנדל"ן
                בישראל. הצוות שלי כולל מומחים ברמה גבוהה: מומחי נדל"ן, עורכי
                דין, ויועצי משכנתאות. אנו מעריכים כל אחד מלקוחותינו ועושים כמיטב
                יכולתנו לעמוד בציפיותיך. אני באופן אישי שולט בתהליכי העבודה
                ומבטיח כי תקבל שירות מעולה באנרגיות חיוביות משיתוף פעולה איתנו.
                אתה יכול להיות בטוח שכל העסקאות עם הנדל"ן שלך יבוצעו בבטחה, בזמן
                וברמה מקצועית גבוהה.</span
              >
            </p>
          </div>
        </article>
        <article class="my-8">
          <img
            class="w-full object-cover sm:h-72 md:h-96 lg:w-full lg:h-full"
            src="https://images.unsplash.com/photo-1459767129954-1b1c1f9b9ace?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1050&q=80"
            alt="building"
            width="1050"
            height="700"
          />
          <div
            class="bg-gray-100 flex lg:flex-row flex-col items-start p-3 my-5"
          >
            <div class="p-5">
              <h3 class="text-2xl font-bold mb-4">למה לבחור דווקא בי ?</h3>
              <ul class="list-disc text-xl text-justify leading-relaxed">
                <li class="mb-3">
                  נדל"ן דורש לא רק את האפשרות למצוא לקוחות או חפץ, אלא גם ללוות
                  את העסקה. בממוצע, לקוחותיי מקבלים הצעות שהן רווחיות ב -10%
                  מהשוק, מכיוון שאני משתלט על תהליך המשא ומתן. אין משימה כזו
                  בשבילי שאני לא מוכן לקחת על עצמי.
                </li>
                <li class="mb-3">
                  נדל"ן יוקרתי, נדל"ן מסחרי, מכירת או קניית דירה, השכרה - כל אלה
                  אתגרים מעניינים. הדבר החשוב ביותר הוא שעל ידי פתרון בעיות אלה,
                  אני מבטיח שכל הצדדים יהיו מרוצים.
                </li>
                <li>
                  התמחות בבתי מגורים, ניתוח סביבה קהילתית להתאמה אישית ניתוח
                  אפיון והתאמה של הנכס בהתאם למיקומו ואומדנו ליווי אישי בתהליכי
                  רכישה/מכירה הגדלת פוטנציאל החשיפה למעגל לקוחות רחב בעל ידע רחב
                  בתכניות מתאר עתידיות באזור מגוריך.
                </li>
              </ul>
            </div>
            <img
              class="w-full lg:h-full h-96 sm:h-84 object-contain"
              src="@/assets/images/license.webp"
              alt="license"
              width="331"
              height="486"
            />
          </div>
          <img
            class="w-full object-cover sm:h-72 md:h-96 lg:w-full lg:h-full mb-8"
            src="https://images.unsplash.com/photo-1579725942955-4d8377f8c66a?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=967&q=80"
            alt="flat"
            width="967"
            height="725"
          />
        </article>
        <article id="contact" class="pb-5">
          <h2 class="text-center text-5xl">נהיה בקשר</h2>
          <form
            dir="rtl"
            action="#"
            class="mx-auto w-full md:w-3/4 lg:w-4/6 p-5"
          >
            <transition name="slide-fade" v-if="success" appear>
              <div
                class="p-5 border border-red-400 bg-green-300 text-green-900 flex my-2"
              >
                <span class="mr-6">
                  <span class="absolute follows-links successfull"></span>
                </span>
                הטופס נשלח בהצלחה!
              </div>
            </transition>
            <div class="flex flex-col md:flex-row">
              <div class="flex-1">
                <div class="p-3">
                  <input
                    class="block appearance-none placeholder-gray-500 placeholder-opacity-100 border border-light-blue-500 w-full py-3 px-4 text-gray-700 leading-5 focus:outline-none focus:ring-2 focus:ring-light-blue-300"
                    type="text"
                    id="name"
                    v-model="name"
                    placeholder="שם"
                    required
                  />
                </div>
                <div class="p-3">
                  <input
                    class="block appearance-none placeholder-gray-500 placeholder-opacity-100 border border-light-blue-500 w-full py-3 px-4 text-gray-700 leading-5 focus:outline-none focus:ring-2 focus:ring-light-blue-300"
                    type="email"
                    id="email"
                    v-model="email"
                    placeholder="מייל"
                    required
                  />
                </div>
                <div class="p-3">
                  <input
                    class="block appearance-none placeholder-gray-500 placeholder-opacity-100 border border-light-blue-500 w-full py-3 px-4 text-gray-700 leading-5 focus:outline-none focus:ring-2 focus:ring-light-blue-300"
                    type="tel"
                    id="tel"
                    v-model="tel"
                    placeholder="מספר טלפון"
                    required
                  />
                </div>
              </div>
              <div class="p-3 flex-1">
                <textarea
                  class="resize-none border block appearance-none placeholder-gray-500 placeholder-opacity-100 border border-light-blue-500 w-full py-3 px-4 text-gray-700 leading-5 focus:outline-none focus:ring-2 focus:ring-light-blue-300 h-56"
                  placeholder="הודעה"
                  id="message"
                  v-model="message"
                  required
                ></textarea>
              </div>
            </div>
            <div
              class="p-3 pt-4 flex flex-col-reverse md:flex-row md:items-end items-center justify-between"
            >
              <div class="mt-3 md:mt-0">
                <h4 dir="ltr" class="text-center font-semibold">Social links:</h4>
                <a
                  target="_blank"
                  rel="noreferrer"
                  href="https://facebook.com/nitay.dor"
                  class="p-3 border-2 border-gray-700 transition duration-500 ease-in-out hover:bg-gray-800 font-semibold text-white inline-flex items-center space-x-2"
                >
                  <svg
                    class="w-6 h-6"
                    role="img"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 24 24"
                  >
                    <title>Facebook</title>
                    <path
                      d="M24 12.073c0-6.627-5.373-12-12-12s-12 5.373-12 12c0 5.99 4.388 10.954 10.125 11.854v-8.385H7.078v-3.47h3.047V9.43c0-3.007 1.792-4.669 4.533-4.669 1.312 0 2.686.235 2.686.235v2.953H15.83c-1.491 0-1.956.925-1.956 1.874v2.25h3.328l-.532 3.47h-2.796v8.385C19.612 23.027 24 18.062 24 12.073z"
                    />
                  </svg>
                </a>
                <a
                  rel="noreferrer"
                  href="https://www.instagram.com/nitay_dor/"
                  target="_blank"
                  class="p-3 border-2 border-gray-700 transition duration-500 ease-in-out hover:bg-gray-800 font-semibold text-white inline-flex items-center space-x-2"
                >
                  <svg
                    class="w-6 h-6"
                    role="img"
                    viewBox="0 0 150 150"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <title>Instagram</title>
                    <path
                      d="M41.668 0C18.6914 0 0 18.6914 0 41.668V108.332C0 131.309 18.6914 150 41.668 150H108.332C131.309 150 150 131.309 150 108.332V41.668C150 18.6914 131.309 0 108.332 0H41.668ZM41.668 16.668H108.332C122.117 16.668 133.332 27.8828 133.332 41.668V108.332C133.332 122.117 122.117 133.332 108.332 133.332H41.668C27.8828 133.332 16.668 122.117 16.668 108.332V41.668C16.668 27.8828 27.8828 16.668 41.668 16.668ZM116.668 25C116.121 25 115.578 25.0547 115.039 25.1602C114.504 25.2656 113.984 25.4258 113.477 25.6328C112.973 25.8438 112.492 26.1016 112.035 26.4062C111.582 26.707 111.16 27.0547 110.773 27.4414C110.387 27.8281 110.043 28.25 109.738 28.7031C109.434 29.1602 109.176 29.6406 108.969 30.1445C108.758 30.6484 108.602 31.1719 108.492 31.707C108.387 32.2461 108.332 32.7852 108.332 33.332C108.332 33.8789 108.387 34.4219 108.492 34.9609C108.602 35.4961 108.758 36.0156 108.969 36.5234C109.176 37.0273 109.434 37.5078 109.738 37.9648C110.043 38.418 110.387 38.8398 110.773 39.2266C111.16 39.6133 111.582 39.957 112.035 40.2617C112.492 40.5664 112.973 40.8242 113.477 41.0312C113.984 41.2422 114.504 41.3984 115.039 41.5078C115.578 41.6133 116.121 41.668 116.668 41.668C117.215 41.668 117.754 41.6133 118.293 41.5078C118.828 41.3984 119.352 41.2422 119.855 41.0312C120.359 40.8242 120.84 40.5664 121.297 40.2617C121.75 39.957 122.172 39.6133 122.559 39.2266C122.945 38.8398 123.293 38.418 123.594 37.9648C123.898 37.5078 124.156 37.0273 124.367 36.5234C124.574 36.0156 124.734 35.4961 124.84 34.9609C124.945 34.4219 125 33.8789 125 33.332C125 32.7852 124.945 32.2461 124.84 31.707C124.734 31.1719 124.574 30.6484 124.367 30.1445C124.156 29.6406 123.898 29.1602 123.594 28.7031C123.293 28.25 122.945 27.8281 122.559 27.4414C122.172 27.0547 121.75 26.707 121.297 26.4062C120.84 26.1016 120.359 25.8438 119.855 25.6328C119.352 25.4258 118.828 25.2656 118.293 25.1602C117.754 25.0547 117.215 25 116.668 25ZM75 33.332C52.0234 33.332 33.332 52.0234 33.332 75C33.332 97.9766 52.0234 116.668 75 116.668C97.9766 116.668 116.668 97.9766 116.668 75C116.668 52.0234 97.9766 33.332 75 33.332ZM75 50C88.7852 50 100 61.2148 100 75C100 88.7852 88.7852 100 75 100C61.2148 100 50 88.7852 50 75C50 61.2148 61.2148 50 75 50Z"
                    />
                  </svg>
                </a>
                <a
                  rel="noreferrer"
                  href="https://bit.ly/3AkvUgK"
                  target="_blank"
                  class="p-3 border-2 border-gray-700 transition duration-500 ease-in-out hover:bg-gray-800 font-semibold text-white inline-flex items-center space-x-2"
                >
                  <svg
                    class="w-6 h-6"
                    role="img"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 90 86"
                  >
                    <title>Whatsapp</title>
                    <path
                      d="M61.6011 63.1709C56.8422 67.9298 44.7476 63.5471 34.5903 53.3899C24.433 43.2326 20.0504 31.1379 24.8092 26.3791L29.7374 21.4509C30.6026 20.5857 31.9946 20.5857 32.8598 21.4509L37.9008 26.4919C38.7661 27.3572 38.7661 28.7491 37.9008 29.6144L34.4774 33.0377C31.8253 35.6899 34.1577 42.405 39.8006 48.0667C45.4435 53.7284 52.3091 56.1737 54.9613 53.5215L58.3658 50.0982C59.2311 49.2329 60.623 49.2329 61.4882 50.0982L66.5292 55.1392C67.3945 56.0044 67.3945 57.3963 66.5292 58.2616L61.6011 63.1709Z"
                    />
                    <path
                      d="M59.6073 61.1771C59.4944 61.2711 58.8925 61.7602 59.2875 61.4781C59.7013 61.1959 59.0054 61.6473 58.9113 61.7038C58.7796 61.779 58.4975 61.9859 58.3282 61.9859C58.6292 61.9859 58.8549 61.8166 58.5351 61.8919C58.3658 61.9295 58.2154 62.0047 58.0649 62.0423C57.8392 62.0988 57.6134 62.1552 57.3877 62.1928C56.5977 62.3621 57.8204 62.1928 57.162 62.2304C56.5601 62.2681 55.9582 62.2869 55.3375 62.2493C55.0741 62.2304 54.792 62.1928 54.5286 62.174C55.3187 62.2493 54.3029 62.1176 54.1148 62.08C53.4377 61.9483 52.7793 61.779 52.121 61.5721C51.4627 61.3652 50.8043 61.1395 50.146 60.895C49.9955 60.8385 49.8262 60.7633 49.6757 60.7069C50.1648 60.9138 49.6381 60.688 49.5064 60.6316C49.0926 60.4435 48.6976 60.2554 48.3026 60.0673C45.1614 58.5061 42.2647 56.5123 39.763 54.368C38.2206 53.0513 36.7722 51.6594 35.3803 50.1922C34.1389 48.8755 32.7658 47.2767 31.8441 46.0353C30.8096 44.6245 29.8314 43.1762 28.9662 41.6526C28.5712 40.9754 28.195 40.2607 27.8564 39.5647C27.7059 39.2449 27.5367 38.9252 27.405 38.5866C27.4238 38.6242 27.0664 37.8342 27.2357 38.2104C27.3674 38.5302 27.104 37.8906 27.0852 37.8342C26.5586 36.5175 26.1447 35.1632 25.8814 33.7713C25.8438 33.5268 25.7309 32.812 25.8062 33.4703C25.7685 33.1694 25.7309 32.8684 25.7121 32.5487C25.6745 31.9468 25.7309 31.3448 25.7309 30.7429C25.7309 30.4796 25.6181 30.4608 25.6933 30.9498C25.6745 30.8746 25.7309 30.6865 25.7497 30.6113C25.8062 30.3667 25.8626 30.1034 25.9378 29.8589C25.9755 29.746 26.0131 29.652 26.0319 29.5391C26.1824 28.9936 26.0131 29.7084 25.9566 29.6708C25.919 29.652 26.2952 28.9936 26.3328 28.956C26.3893 28.862 26.4645 28.7867 26.5021 28.6927C26.6714 28.3729 26.3705 28.7303 26.3516 28.8808C26.3893 28.7303 26.6714 28.5046 26.7843 28.4105C26.9159 28.2788 27.0288 28.166 27.1605 28.0343C28.5148 26.68 29.8691 25.3257 31.2046 23.9902C31.2798 23.915 31.656 23.6328 31.6748 23.52C31.6748 23.52 31.4115 23.6328 31.2986 23.6893C31.4867 23.614 31.75 23.6705 31.261 23.6705C30.96 23.614 30.9036 23.5952 31.1105 23.6517C31.2986 23.7081 31.261 23.6893 30.9977 23.614C30.9788 23.52 30.7719 23.4071 31.0729 23.7269C31.3362 24.009 31.6372 24.2912 31.9005 24.5545C32.6341 25.2881 33.3865 26.0405 34.1201 26.7741C34.6279 27.2819 35.1546 28.0155 35.7377 28.3917C35.7377 28.3917 35.8318 28.5046 35.8506 28.5046C35.7565 28.5234 35.6625 28.1284 35.6625 28.1096C35.7377 28.26 35.7189 28.5986 35.6813 28.0719C35.6625 27.8838 35.8694 27.6017 35.6625 28.0343C35.6437 28.0719 35.7941 27.6017 35.8506 27.6393C35.8318 27.6393 35.7189 27.771 35.7001 27.7898C34.9853 28.4105 34.3458 29.1441 33.6874 29.8024C33.1984 30.2915 32.6717 30.7617 32.2203 31.2884C31.1669 32.4922 30.6779 33.9218 30.5462 35.5018C30.2641 38.5678 31.656 41.7842 33.2172 44.3424C35.3427 47.8598 38.2394 50.8505 41.5311 53.2958C45.8385 56.4935 52.7793 59.6723 57.2749 55.158C57.9896 54.4432 58.7232 53.7096 59.438 52.9949C59.6825 52.7503 59.9459 52.5246 60.1716 52.2613C60.1716 52.2613 60.322 52.1296 60.322 52.1108C60.3409 52.186 59.9459 52.2989 59.927 52.2989C60.3032 52.1296 59.9835 52.2048 59.7578 52.2613C59.7201 52.2613 59.6637 52.2425 59.6261 52.2425C59.9459 52.3365 59.9459 52.3365 59.6261 52.2425C59.6261 52.2237 59.4568 52.1296 59.4568 52.1296C59.4568 52.1296 59.5508 52.2237 59.5697 52.2425C59.7389 52.5058 60.0587 52.7315 60.2656 52.9384C60.9804 53.6532 61.714 54.3868 62.4287 55.1016C63.0495 55.7223 63.6326 56.3618 64.2721 56.9449C64.5166 57.1706 64.479 57.2459 64.3285 56.8697C64.1969 56.5499 64.3097 57.434 64.3097 56.7192C64.3097 56.5311 64.4978 56.2678 64.2909 56.6816C64.3473 56.5499 64.5166 56.3242 64.4414 56.3242C64.3285 56.3242 64.0652 56.7004 63.9899 56.7756C63.6514 57.1142 63.3128 57.4528 62.993 57.7725C62.2218 58.5437 61.4694 59.2961 60.6982 60.0673C60.3785 60.4247 59.9835 60.8009 59.6073 61.1771C58.5351 62.2493 58.5351 64.0926 59.6073 65.1648C60.6794 66.2369 62.5228 66.2369 63.5949 65.1648C64.8364 63.9233 66.0778 62.6819 67.3193 61.4404C67.7707 60.989 68.2598 60.5376 68.6924 60.0485C70.4605 58.0171 70.3476 55.0827 68.5231 53.1265C67.3193 51.8475 66.0402 50.6436 64.7988 49.4022C64.3661 48.9696 63.9523 48.5181 63.5009 48.1043C61.5447 46.2986 58.6104 46.1481 56.5789 47.935C55.3187 49.0448 54.1525 50.3051 52.9862 51.5089C52.8922 51.6029 52.4972 51.8663 52.8922 51.6217C53.3248 51.3396 52.8358 51.6406 52.7793 51.6594C52.4031 51.8098 53.0239 51.6782 53.0051 51.5841C53.0051 51.6029 52.2151 51.8475 52.1962 51.8098C52.1774 51.7722 52.9674 51.7722 52.4031 51.7722C52.215 51.7722 52.0269 51.791 51.8389 51.791C51.7072 51.791 51.5755 51.791 51.4439 51.7722C51.3874 51.7722 50.7479 51.6782 51.1993 51.7534C51.6884 51.8287 50.9736 51.697 50.936 51.697C50.7855 51.6594 50.635 51.6406 50.5034 51.6029C50.1272 51.5089 49.751 51.396 49.3748 51.2644C49.2243 51.2079 49.055 51.1515 48.9045 51.0951C48.1333 50.8129 49.3748 51.3396 48.6224 50.9822C47.87 50.6248 47.1364 50.2298 46.4216 49.7972C45.6504 49.327 44.7288 48.6874 44.2397 48.3112C42.6033 47.0134 41.1549 45.5274 39.8006 43.9286C39.4432 43.5147 38.8789 42.7059 38.4275 42.0288C37.9196 41.2388 37.4682 40.4299 37.0732 39.5835C36.998 39.433 36.9227 39.2637 36.8663 39.1133C37.0732 39.6023 36.8663 39.0945 36.8287 38.9628C36.7158 38.6242 36.5841 38.2856 36.4901 37.9471C36.396 37.6273 36.3396 37.2887 36.2644 36.969C36.2268 36.7809 36.208 36.2918 36.2644 36.9878C36.2456 36.7809 36.2268 36.5928 36.2268 36.3859C36.2268 36.1037 36.2644 35.8216 36.2456 35.5394C36.2268 35.182 36.0199 36.1978 36.2456 35.6711C36.2832 35.577 36.302 35.4266 36.3396 35.3513C36.5089 34.6177 36.1139 35.7275 36.4149 35.2008C36.7158 34.6742 35.9634 35.5958 36.5089 35.0692C37.1108 34.4861 37.6939 33.8842 38.277 33.3011C38.8225 32.7556 39.4056 32.2289 39.9323 31.6458C41.7568 29.6896 41.8885 26.7553 40.1016 24.7238C38.9354 23.3883 37.5811 22.1845 36.3208 20.9242C35.8506 20.454 35.3991 19.9649 34.9101 19.5135C33.1796 17.8959 30.565 17.5197 28.5524 18.8928C26.9536 19.9838 25.6557 21.639 24.3014 22.9933C22.853 24.4417 21.5364 25.796 20.784 27.7522C19.787 30.3667 20.0316 33.3763 20.6523 36.0661C21.4235 39.4142 22.9659 42.6119 24.7528 45.5274C29.0791 52.5999 35.2675 58.7883 42.3023 63.1709C45.199 64.9767 48.3779 66.5191 51.6884 67.3467C54.3782 68.0238 57.4253 68.3248 60.0963 67.3843C61.4318 66.9141 62.6168 66.2181 63.6514 65.2212C64.7423 64.1678 64.7235 62.3057 63.6514 61.2335C62.504 60.0861 60.6982 60.1238 59.6073 61.1771Z"
                    />
                    <path
                      d="M17.812 74.3251C24.8657 80.8145 33.7815 84.8021 43.3368 85.6862C51.5755 86.4574 59.9835 84.6893 67.2628 80.8145C81.4454 73.2906 90.4176 57.9042 89.985 41.8595C89.59 25.9464 80.0535 11.0115 65.6076 4.20238C58.3282 0.760197 50.1272 -0.688154 42.1142 0.308762C33.9696 1.30568 26.4269 4.48453 20.0316 9.61959C6.69546 20.2847 1.07135 38.6618 5.88664 55.0075C6.60141 57.434 7.56071 59.804 8.67048 62.08C8.67048 61.1395 8.67048 60.1802 8.67048 59.2397C6.24403 63.9045 3.81757 68.5505 1.39111 73.2153C1.03373 73.8925 0.695152 74.5508 0.337767 75.228C-0.790818 77.4099 1.07135 79.9868 3.51661 79.3661C8.48239 78.1059 13.467 76.8456 18.4327 75.5854C19.1287 75.4161 19.8435 75.228 20.5394 75.0587C22.0254 74.6825 22.9095 73.0272 22.5145 71.5789C22.1006 70.0741 20.5206 69.2277 19.0347 69.6039C14.0689 70.8641 9.0843 72.1244 4.11853 73.3846C3.42257 73.5539 2.70779 73.742 2.01183 73.9113C3.06518 75.2844 4.13734 76.6763 5.19068 78.0494C7.39142 73.9113 9.55454 69.7543 11.7177 65.5786C12.2067 64.6569 12.677 63.7352 13.166 62.8135C13.2789 62.6066 13.3917 62.3809 13.5046 62.174C13.5798 62.0235 13.6174 61.9483 13.6927 61.7602C14.2005 60.4999 13.6551 59.503 13.1284 58.3744C10.9465 53.6908 9.79907 48.2172 9.79907 42.9316C9.79907 41.8407 9.83669 40.7309 9.93074 39.6399C9.96836 39.1133 10.0248 38.6054 10.0812 38.0787C10.1 37.9471 10.1188 37.8154 10.1376 37.6837C10.1376 37.7213 10.0812 38.1352 10.1188 37.7966C10.1565 37.4956 10.2129 37.1947 10.2505 36.9125C10.6079 34.787 11.1534 32.6803 11.8493 30.6301C12.0186 30.1598 12.1879 29.6896 12.3572 29.2193C12.4512 28.9936 12.5453 28.7491 12.6393 28.5234C12.7522 28.2224 12.6205 28.5798 12.6017 28.6174C12.6581 28.467 12.7334 28.3165 12.8086 28.166C13.2224 27.2255 13.6927 26.285 14.1817 25.3633C15.1598 23.5388 16.2884 21.8083 17.5299 20.1719C17.718 19.9085 17.4923 20.2095 17.4734 20.2471C17.5487 20.153 17.6239 20.059 17.6992 19.9649C17.8496 19.7768 18.0001 19.5888 18.1694 19.3818C18.508 18.968 18.8654 18.573 19.2228 18.1592C19.8999 17.388 20.6147 16.6544 21.3671 15.9397C22.1383 15.2061 22.9471 14.4913 23.7747 13.8142C23.9628 13.6637 24.1509 13.5132 24.3578 13.3439C24.6023 13.137 24.3014 13.3815 24.2826 13.4003C24.3766 13.3251 24.4707 13.2499 24.5835 13.1746C25.0162 12.8549 25.4488 12.5351 25.8814 12.2341C27.5931 11.0679 29.38 10.0334 31.2422 9.13053C31.6936 8.92363 32.145 8.71672 32.5965 8.50981C33.0855 8.2841 32.3331 8.60386 32.841 8.41576C33.1043 8.3029 33.3865 8.20886 33.6498 8.096C34.6279 7.7198 35.6249 7.38123 36.6406 7.09908C37.6563 6.79813 38.6908 6.5536 39.7254 6.32788C40.2709 6.21502 40.8163 6.12097 41.3618 6.02693C41.6252 5.98931 41.8697 5.95169 42.133 5.91407C41.6063 5.98931 42.3587 5.89526 42.5468 5.85764C44.7288 5.61311 46.9295 5.53787 49.1114 5.65073C50.2024 5.70716 51.2746 5.80121 52.3655 5.93288C51.8765 5.87645 52.4596 5.95169 52.6289 5.9705C52.8922 6.00812 53.1367 6.04573 53.3813 6.10216C53.9267 6.19621 54.4722 6.30907 55.0177 6.42193C57.068 6.87336 59.0994 7.49409 61.0556 8.26528C61.1685 8.3029 61.7704 8.54743 61.5259 8.45338C61.2813 8.35933 61.8833 8.60386 61.9961 8.66029C62.5228 8.90482 63.0495 9.14934 63.5761 9.41268C64.4978 9.88292 65.4007 10.372 66.3036 10.8986C67.1876 11.4253 68.0529 11.9896 68.8993 12.5915C69.1062 12.742 69.2943 12.8737 69.5012 13.0242C69.5953 13.0994 70.1031 13.4756 69.8962 13.3251C69.6893 13.1746 70.1972 13.5696 70.2912 13.6449C70.5169 13.833 70.7426 14.0023 70.9496 14.1904C72.5108 15.507 73.9967 16.9554 75.3322 18.4978C75.652 18.874 75.9718 19.2502 76.2915 19.6264C76.442 19.8145 76.5925 20.0026 76.7618 20.2095C76.442 19.8145 76.8934 20.3976 76.9875 20.5292C77.6082 21.3569 78.1725 22.2033 78.718 23.0874C79.2823 23.9902 79.8278 24.9307 80.3168 25.89C80.5425 26.3415 80.7682 26.7741 80.9752 27.2255C81.088 27.4512 81.1821 27.6769 81.2949 27.9027C81.3513 28.0155 81.389 28.1284 81.4454 28.2412C81.4642 28.2977 81.6711 28.7679 81.5394 28.4858C81.4454 28.2412 81.6899 28.862 81.7275 28.956C81.8216 29.1817 81.9156 29.4263 81.9909 29.652C82.179 30.1598 82.3671 30.6865 82.5364 31.1944C82.8561 32.1913 83.1571 33.207 83.4016 34.2415C83.6461 35.2761 83.853 36.3294 84.0223 37.3828C84.0411 37.5521 84.1352 38.154 84.06 37.6461C84.0976 37.9094 84.1164 38.154 84.154 38.4173C84.2104 38.9816 84.2669 39.5459 84.3045 40.1102C84.455 42.3485 84.4173 44.5869 84.2104 46.8253C84.1916 47.0886 84.154 47.3331 84.1352 47.5965C84.1164 47.7846 84.0223 48.3677 84.0976 47.8786C84.0223 48.4241 83.9283 48.9884 83.8342 49.5339C83.6461 50.5872 83.4016 51.6217 83.1195 52.6375C82.8373 53.6532 82.5364 54.6501 82.179 55.647C82.0097 56.1173 81.8216 56.5875 81.6523 57.0578C81.6147 57.1706 81.5583 57.2835 81.5018 57.4151C81.5206 57.3775 81.6711 57.0201 81.5394 57.3211C81.4266 57.5844 81.3137 57.8478 81.1821 58.1111C80.3168 59.9921 79.3199 61.8166 78.1725 63.5283C77.9092 63.9421 77.627 64.3559 77.3261 64.7509C77.1756 64.9579 77.0439 65.146 76.8934 65.3529C76.8182 65.4469 76.743 65.541 76.6677 65.6538C76.4044 65.9924 76.9311 65.3341 76.6489 65.6726C75.9906 66.5191 75.2946 67.3279 74.561 68.1179C73.1691 69.6227 71.6643 71.0146 70.0467 72.3125C69.9526 72.3877 69.8586 72.4629 69.7645 72.5382C69.8022 72.5194 70.1031 72.2748 69.8398 72.4818C69.6329 72.6322 69.4448 72.7827 69.2379 72.9144C68.8052 73.2341 68.3726 73.5351 67.9212 73.8361C67.0559 74.4192 66.1907 74.9458 65.2878 75.4537C64.385 75.9616 63.4633 76.4318 62.5228 76.8644C62.2971 76.9773 62.0714 77.0713 61.8456 77.1654C61.6952 77.2406 61.1497 77.4475 61.6011 77.2782C61.0933 77.4851 60.5854 77.6732 60.0775 77.8613C58.0461 78.5949 55.9582 79.178 53.8515 79.573C53.3436 79.6671 52.8358 79.7423 52.3279 79.8364C51.7824 79.9304 52.6101 79.8176 52.0458 79.874C51.7448 79.9116 51.4439 79.9492 51.1429 79.968C50.0519 80.0809 48.961 80.1373 47.87 80.1561C46.6097 80.1749 45.3495 80.1561 44.108 80.0621C43.4873 80.0245 42.8666 79.9492 42.2647 79.8928C41.9261 79.8552 42.1895 79.8928 42.2459 79.8928C42.0954 79.874 41.9449 79.8552 41.7944 79.8176C41.4371 79.7611 41.0985 79.7047 40.7411 79.6483C35.6437 78.7454 31.4679 77.1278 27.1605 74.4192C26.1635 73.7984 25.2043 73.1213 24.2638 72.4065C24.0004 72.2184 24.2073 72.3501 24.2638 72.4065C24.1509 72.3125 24.038 72.2184 23.9252 72.1244C23.6995 71.9363 23.4738 71.7482 23.248 71.5601C22.759 71.1463 22.2887 70.7324 21.8185 70.2998C20.6899 69.2653 18.9406 69.19 17.8308 70.2998C16.7775 71.3908 16.6834 73.2906 17.812 74.3251Z"
                    />
                  </svg>
                </a>
              </div>
              <button
                class="flex font-bold transition duration-500 ease-in-out hover:bg-gray-800 hover:text-gray-50 border-2 border-gray-700 py-3 px-4 text-2xl"
                @click.prevent="send"
              >
                <svg
                  v-if="pending"
                  class="animate-spin ml-2 h-5 w-5 text-dark"
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                >
                  <circle
                    class="opacity-25"
                    cx="12"
                    cy="12"
                    r="10"
                    stroke="currentColor"
                    stroke-width="4"
                  ></circle>
                  <path
                    class="opacity-75"
                    fill="currentColor"
                    d="M4 12a8 8 0 018-8V0C5.373 0 0 5.373 0 12h4zm2 5.291A7.962 7.962 0 014 12H0c0 3.042 1.135 5.824 3 7.938l3-2.647z"
                  ></path>
                </svg>
                <span>Send form</span>
              </button>
            </div>
          </form>
        </article>
      </main>
      <footer>
        <nav dir="ltr" class="z-10 pb-8 sm:py-0 bg-gray-100">
          <div class="px-4 py-2">
            <div
              class="flex flex-col sm:flex-row items-center justify-between h-16"
            >
              <p>
                Website Design by
                <a href="https://xifolio.com/" rel="noreferrer" target="_blank"
                  >Xirade</a
                >
              </p>
              <div class="flex space-s-6 py-3 text-gray-900 font-medium">
                <a
                  class="transition duration-500 ease-in-out hover:text-gray-500 "
                  href="#"
                  >Home</a
                >
                <a
                  class="transition duration-500 ease-in-out hover:text-gray-500 "
                  href="#about"
                  >About</a
                >
                <a
                  class="transition duration-500 ease-in-out hover:text-gray-500 "
                  href="#contact"
                  >Contact</a
                >
              </div>
              <p class="font-semibold">
                © 2021 Nitay Dor
              </p>
            </div>
          </div>
        </nav>
      </footer>
      <a
        href="tel:0525357888"
        class="block w-14 h-14 transition duration-500 ease-in-out  border-2 bg-gray-800 hover:bg-gray-50 border-gray-700 chat-btn rounded-full"
      >
        <img
          class="absolute h-8 w-8 top-2.5 left-2.5"
          src="@/assets/images/phone.svg"
          alt="phone"
        />
      </a>
    </div>
  </transition-group>
</template>

<script>
export default {
  data: () => ({
    name: "",
    email: "",
    tel: "",
    message: "",
    messages: [],
    pending: false,
    success: false
  }),
  methods: {
    send() {
      this.messages = [];
      this.triggerSendMessageFunction();
    },
    async triggerSendMessageFunction() {
      try {
        if (this.name && this.email && this.message && this.tel) {
          this.pending = true;
          const response = await this.$axios.$post(
            "/.netlify/functions/send-contact-email",
            {
              contactName: this.name,
              contactEmail: this.email,
              message: this.message,
              phone: this.tel
            }
          );
          this.success = true;
          setTimeout(() => (this.success = false), 2000);
          // Reset form field
          this.name = "";
          this.email = "";
          this.message = "";
          this.pending = false;
          this.messages.push({ type: "success", text: response });
        }
      } catch (error) {
        this.messages.push({ type: "error", text: error.response.data });
      }
    },
    beforeEnter(el) {
      el.style.opacity = 0;
    },
    enter(el, done) {
      const gsap = this.$gsap;

      gsap.to(el, {
        opacity: 1,
        duration: 2,
        onComplete: done
      });
    }
  }
};
</script>

<style>
q {
  quotes: "“" "”" "‘" "’";
}
q::before {
  position: absolute;
  content: open-quote;
  font-size: 0;
  left: 10px;
  width: 40px;
  height: 40px;
  background-size: contain;
  background-repeat: no-repeat;
  background-image: url("@/assets/images/quotes.svg");
}
q::after {
  content: close-quote;
}

a:hover svg {
  fill: white;
}

.chat-btn {
  position: fixed;
  right: 14px;
  bottom: 55px;
}

.chat-btn img {
  filter: brightness(0) invert(1);
}

.chat-btn:hover img {
  filter: brightness(0) invert(0);
}

.slide-fade-enter-active {
  transition: all 0.3s ease;
}
.slide-fade-leave-active {
  transition: all 0.8s cubic-bezier(1, 0.5, 0.8, 1);
}
.slide-fade-enter, .slide-fade-leave-to
/* .slide-fade-leave-active below version 2.1.8 */ {
  transform: translateY(10px);
  opacity: 0;
}

.successfull {
  background-image: url("~/assets/images/icon-check-circle.svg");
}
</style>
